---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.Azimuth
source: html/e4908ede-9cb1-a604-1a3c-443d39709eb0.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.Azimuth Property

Azimuth setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings
 element that uses lighting mode.

## Syntax (C#)
```csharp
public double Azimuth { get; set; }
```